In [1]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, None, 35, 40, 45],
    'City': ['New York', 'Los Angeles', None , 'Houston', 'Seattle']
}

df = pd.DataFrame(data)
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0         None
3    David  40.0      Houston
4      Eva  45.0      Seattle

In [2]:
df.isnull()

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
4  False  False  False

In [3]:
df_cleaned = df.dropna()
df_cleaned

    Name   Age      City
0  Alice  25.0  New York
3  David  40.0   Houston
4    Eva  45.0   Seattle

In [4]:
df_cleaned = df.dropna(axis=1)
df_cleaned

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

In [5]:
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0         None
3    David  40.0      Houston
4      Eva  45.0      Seattle

In [8]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [9]:
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie  35.0         None
3    David  40.0      Houston
4      Eva  45.0      Seattle

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes